Revit 2016 API
DocumentPrintingEventArgs Properties
The DocumentPrintingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
Document
 The document associated with the event.
 (Inherited from RevitAPIPreDocEventArgs.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
Settings
 The print settings of the active printing session.
See Also
DocumentPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace